{
  "title": "Dedicated Team | Freshcode",
  "keywords":"dedicated team, remote web developers, remote team, outsource services",
  "description": "Freshcode dedicated team of web developers chosen according to project’s requirements is a guarantee to success. Pick up a remote team for your project.",
  "name": "Your Own Dedicated Team",
  "text": "Every great project deserves our undivided attention. That’s why we offer to create your own dedicated team. Its members will work on your project exclusively without any outside distractions. All their time and energy will be devoted to making your ideas happen.<br><br>Setting up your own dedicated team is easy. When we are on the same page about your project’s requirements, we accurately estimate the time and resources needed. After that, every dedicated team member gets chosen based on his or her skill set and expertise so that your project perfectly suits your requirements and is finished in time.",
  "page-background": "/img/dedicated_team/table.png",
  "alt": "Dedicated team working at the table",
  "reasons": [
    {
      "header": "Save Time and Resources",
      "text": "Creating a development team from scratch is a daunting task that robs you of time and money better spent on the other project’s needs. When we create a dedicated team, it is perfectly suited for your requirements. We provide your team with a stimulating workspace and top-notch equipment, tried-and-true organizational structure and project management methodology. While we take care of the mundane tasks, you can stay focused on building and expanding your business.",
      "image_mobile": "/img/dedicated_team/desktop/icon_clock.png",
      "image_desktop": "/img/dedicated_team/mobile/icon_clock.png",
      "alt": "Alarm clock"
    },
    {
      "header": "Get the Best Team Working on Your Project",
      "text": "Once you create a dedicated team, all its member focus solely on your needs and goals, working on your project without being sidetracked. Every member of the team is selected exclusively on the basis of previous experience, skill set and expertise. Provided with the best equipment and resources the team works tirelessly to reach your goals within the set timeframe.",
      "image_mobile": "/img/dedicated_team/desktop/icon_team.png",
      "image_desktop": "/img/dedicated_team/mobile/icon_team.png",
      "alt": "Team of three people"
    },
    {
      "header": "Enjoy the High-End Technologies and Solutions",
      "text": "Every complete project is an educational experience for our developers. They never stop working on widening their fields of expertise and learning new and exciting ways to shake up the IT world. They innovate and develop outside of the box solutions giving your project an edge over the competition.",
      "image_mobile": "/img/dedicated_team/desktop/icon_technologies.png",
      "image_desktop": "/img/dedicated_team/mobile/icon_technologies.png",
      "alt": "JavaScript icons"
    },
    {
      "header": "Keep Your Hand on the Pulse",
      "text": "We implement the tried and true project management and tracking tools so that you can keep a close eye the project’s progress. You only pay for the hours your dedicated team spends working on the project and thus get a chance to allocate your resources efficiently and to stay within the budget.",
      "image_mobile": "/img/dedicated_team/desktop/icon_keep.png",
      "image_desktop": "/img/dedicated_team/mobile/icon_keep.png",
      "alt": "Binocular"
    },
    {
      "header": "Obtain Timely Support",
      "text": "Every new project is bound to face some challenges and unforeseen problems. Your dedicated team will be there to support you in times of crisis and quickly resolve any occurring troubles. We will assist you in any way we can and prevent further crises from happening.",
      "image_mobile": "/img/dedicated_team/desktop/icon_support.png",
      "image_desktop": "/img/dedicated_team/mobile/icon_support.png",
      "alt": "Woman with headphones and micro"
    }
  ],
  "works": [
    {
      "title": "GommeHD",
      "description": "GommeHD is one of the leading Minecraft Servers with more than 1 million players throughout the world. The site delivers community news and statistics, as well as the latest updates and videos.",
      "cover": "/img/main/work_2.jpg",
      "alt": "GommeHD platform preview",
      "link": "/gommehd",
      "mainColor": "#775441"
    },
    {
      "title": "TWENTY ONE LEARNING",
      "description": "Twenty One Learning is an interactive platform which main objective was to allow collaborative creation of lectures, presentations, slides and text with open access to all materials.",
      "cover": "/img/main/work_6p.jpg",
      "alt": "Twenty One Learning platform preview",
      "link":  "/twenty-one-learning",
      "mainColor": "#576965"
    },
    {
      "title": "Play Attention",
      "description": "Play Attention is indisputably the best cognitive training system created to improve attention, behavior and cognitive function for children and adults suffering from ADHD.",
      "cover": "/img/main/work_3.jpg",
      "alt": "Play Attention system preview",
      "link": "/playattention",
      "mainColor": "#5d738f"
    },
    {
      "title": "Educadio",
      "description": "Educadio is a Digital Learning Tool that provides a real-time synchronization for instant user collaboration and a wide variety of collaborative work means, including video and text chats.",
      "cover": "/img/main/work_6.jpg",
      "alt": "Educadio platform preview",
      "link": "/educadio",
      "mainColor": "#354356"
    }
  ]
}