{
  "title": "Our Approach to Software Development | Freshcode",
  "name": "Our Approach to Software Development",
  "keywords":"Freshcode approach, agile methods, agile web development",
  "description":"Freshcode developers abide Agile methods to make the process of web development as smooth as possible.",
  "text": "You've got a brilliant idea, but don't know how to turn it into a profitable solution? Let us help you! The road to success may seem too long and difficult at first, but be assured that every step of the way you'll have our full support. We abide the principles of Agile development to make sure every project reaches its full potential.",
  "background": "our_approach/banner_approach.jpg",
  "alt":"Rocket Launch",
  "short": [
    {
      "name": "Before we start",
      "text": "You have an idea, but can't imagine how the finished product must look like? That's not a problem. Simply list the desired features and prioritize them. Communication and collaboration are the keys to success, so you are welcome to tell us everything about your idea. Share your goals and needs, solutions you love and hate, and, of course, what your clients are like. Any piece of information will be useful for creating the perfect solution.",
      "icon": "our_approach/icon_1.png",
      "alt":"Alarm clock icon"
    },
    {
      "name": "Get a rough estimate and a step-by-step plan",
      "text": "After you define your wants and needs, we estimate how much resources each and every one of your requirements will take. This allows us to plan the project's timeline and lets you to control which tasks you wish to be completed first. Using your input we divide work into sprints and get down to business of designing, developing and testing.",
      "icon": "our_approach/icon_2.png",
      "alt":" Weigh-scale icon"
    },
    {
      "name": "Try out new features before the project is done",
      "text": "Using iterative development we ensure that each version of every feature becomes better, smarter, cleaner. Every sprint is completed with a set of fulfilled goals and developed features. We test them on the go, so that by the end of the sprint you can try them out and require changes, if necessary. In the spirit of Agile development we use flexible methods, that allow improvements to be made at any point during the project.",
      "icon": "our_approach/icon_3.png",
      "alt":"New project icon"
    },
    {
      "name": "Check the progress regularly",
      "text": "We implement the best project management tools so that you can always check our progress. Along the way our project managers ensure complete transparency through constant updates and reviews. We value your input and use it to provide great user experience for your future customers.",
      "icon": "our_approach/icon_4.png",
      "alt":"Eye icon"
    },
    {
      "name": "Enjoy the finished product",
      "text": "This tried and true approach has already yielded great results, and your project is sure to be perfect. When all your requirements are met, it's time for launching and reaping the benefits.",
      "icon": "our_approach/icon_5.png",
      "alt":"Smiling face icon"
    },
    {
      "name": "Come back for more",
      "text": "And even when you product is finished and launched, we won't part forever. You're always welcome to turn to us for any kind of help, support or maintenance. And we'll be glad to join you on another exciting journey.",
      "icon": "our_approach/icon_6.png",
      "alt": "Round arrow icon"
    }
  ]
}
